#include <bits/stdc++.h>

using namespace std;

class Solution {
public:
    bool isValidSudoku(vector<vector<char>>& board) {
        bool st[11];
        //判断每一行
        for(int i = 0 ; i < 9 ; ++i){
            memset(st,false,sizeof st);
            for(int j = 0 ; j < 9 ; ++j){
                if(board[i][j] != '.'){
                    int t = board[i][j]-'0';
                    if(st[t]) return false;
                    st[t] = true;
                }
            }
        }

        //判断每一列
        for(int i = 0 ; i < 9 ; ++i){
            memset(st,false,sizeof st);
            for(int j = 0 ; j < 9 ; ++j){
                if(board[j][i] != '.'){
                    int t = board[j][i]-'0';
                    if(st[t]) return false;
                    st[t] = true;
                }
            }
        }

        //判断小方格
        for(int i = 0 ; i < 9 ; i+=3){
            for(int j = 0 ; j < 9 ; j+=3){
                memset(st,false,sizeof st);
                for(int x = 0 ; x < 3 ; ++x){
                    for(int y = 0 ; y < 3 ; ++y){
                        if(board[i+x][j+y] != '.'){
                            int t = board[i+x][j+y] - '0';
                            if(st[t]) return false;
                            st[t] = true;
                        }
                    }
                }
            }
        }

        return true;
    }
};


int main()
{
    Solution solution;
    return 0;
}

/*
请你判断一个 9x9 的数独是否有效。只需要 根据以下规则 ，验证已经填入的数字是否有效即可。

数字 1-9 在每一行只能出现一次。
数字 1-9 在每一列只能出现一次。
数字 1-9 在每一个以粗实线分隔的 3x3 宫内只能出现一次。（请参考示例图）
数独部分空格内已填入了数字，空白格用 '.' 表示。

注意：

一个有效的数独（部分已被填充）不一定是可解的。
只需要根据以上规则，验证已经填入的数字是否有效即可。
 

示例 1：


输入：board = 
[["5","3",".",".","7",".",".",".","."]
,["6",".",".","1","9","5",".",".","."]
,[".","9","8",".",".",".",".","6","."]
,["8",".",".",".","6",".",".",".","3"]
,["4",".",".","8",".","3",".",".","1"]
,["7",".",".",".","2",".",".",".","6"]
,[".","6",".",".",".",".","2","8","."]
,[".",".",".","4","1","9",".",".","5"]
,[".",".",".",".","8",".",".","7","9"]]
输出：true
示例 2：

输入：board = 
[["8","3",".",".","7",".",".",".","."]
,["6",".",".","1","9","5",".",".","."]
,[".","9","8",".",".",".",".","6","."]
,["8",".",".",".","6",".",".",".","3"]
,["4",".",".","8",".","3",".",".","1"]
,["7",".",".",".","2",".",".",".","6"]
,[".","6",".",".",".",".","2","8","."]
,[".",".",".","4","1","9",".",".","5"]
,[".",".",".",".","8",".",".","7","9"]]
输出：false
解释：除了第一行的第一个数字从 5 改为 8 以外，空格内其他数字均与 示例1 相同。 但由于位于左上角的 3x3 宫内有两个 8 存在, 因此这个数独是无效的。
 

提示：

board.length == 9
board[i].length == 9
board[i][j] 是一位数字或者 '.'

*/